app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        users = Book.find(params[:id])
        @user = users.user
        @book = Book.new
        @books = Book.find(params[:id])

SELECT "books".* FROM "books"
---
    def books
        @user = current_user
        @book = Book.new
        @books = Book.all#一覧表示するためにBookモデルの情報を全てくださいのall

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sample"], ["body", "test"], ["user_id", 2], ["created_at", "2020-04-12 07:04:37.928095"], ["updated_at", "2020-04-12 07:04:37.928095"]]
---
    def create
        @user = User.find(current_user.id)
        @book = current_user.books.new(books_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
        @books = Book.all
        if @book.save #入力されたデータをdbに保存する。

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "testaaa"], ["updated_at", "2020-04-09 16:00:29.818409"], ["id", 2]]
---
    def update
        @book = Book.find(params[:id])
        if @book.update(books_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def destroy
        book = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        def authbook
            book = Book.find(params[:id])