app/controllers/books_controller.rb

    def create
        @book = Book.new(book_params)
        @book.user_id = current_user.id
        @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["user_id", 1], ["created_at", "2020-04-09 15:46:56.536305"], ["updated_at", "2020-04-09 15:46:56.536305"]]